In [7]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [8]:
dfrmae = pd.read_csv('test.csv') # CSV (Comma seprate values )

In [9]:
dfrmae

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [10]:
# It will add header as 0 to 4 , You can allow pandas to assign default column names.
dfrmae = pd.read_csv('test.csv',header = None)

In [11]:
dfrmae

   0   1   2   3        4
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [15]:
dframe = pd.read_table('test.csv',sep=',',header=None) # Same output like Pd.read_CSV

In [16]:
dframe

   0   1   2   3        4
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [17]:
pd.read_csv('test.csv',names=['a','b','c','d','message'])

   a   b   c   d  message
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [27]:
# Suppose you wanted the message column to be the index of the returned DataFrame.You can either indicate you want 
# the column at index 4 or named 'message' using the index_col argument:

pd.read_csv('test.csv',index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [30]:
 # If we wanted to read first 2 rows
pd.read_csv('test.csv',header=None,nrows=2)

   0  1  2  3        4
0  a  b  c  d  message
1  1  2  3  4    hello

In [31]:
# if we wanted to store dataframe into CSV file

dframe.to_csv('OutTest.csv')

In [32]:
import sys # to show the output in Ipython

dframe.to_csv(sys.stdout)

,0,1,2,3,4
0,a,b,c,d,message
1,1,2,3,4,hello
2,5,6,7,8,world
3,9,10,11,12,foo

In [34]:
# if I wanted to sperate with specific delimeter

dframe.to_csv(sys.stdout,sep="!")

!0!1!2!3!4
0!a!b!c!d!message
1!1!2!3!4!hello
2!5!6!7!8!world
3!9!10!11!12!foo

In [36]:
# if We wanted to only save few cloums 
dframe.to_csv(sys.stdout,columns=[0,1,2])

,0,1,2
0,a,b,c
1,1,2,3
2,5,6,7
3,9,10,11

In [40]:
Frame = pd.read_csv('Test2.csv')

In [41]:
Frame

  key1 key2  value1  value2
0  one    a       1       2
1  one    b       3       4
2  one    c       5       6
3  one    d       7       8
4  two    a       9      10
5  two    b      11      12
6  two    c      13      14
7  two    d      15      16

In [44]:
# a hierarchical index from multiple columns, just pass a list of column numbers or names:
Frame = pd.read_csv('Test2.csv',index_col=['key1','key2'])

In [45]:
Frame

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [46]:
dframe

   0   1   2   3        4
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [48]:
pd.read_csv('test.csv',skiprows=[0,3]) # TO skip the rows

   1  2  3  4  hello
0  5  6  7  8  world

In [50]:
# JSON DATA (short for JavaScript Object Notation) #

In [51]:
# JSON Data in strin format
josn_obj = """
{"name": "Wes","places_lived": ["United States", "Spain", "Germany"],"pet": null,
"siblings": [{"name": "Scott", "age": 25, "pet": "Zuko"},{"name": "Katie", "age": 33, "pet": "Cisco"}]
}
"""

In [52]:
import json

In [53]:
data = json.loads(josn_obj) # loads() use for loading string JSON data

In [54]:
data

{'name': 'Wes',
 'pet': None,
 'places_lived': ['United States', 'Spain', 'Germany'],
 'siblings': [{'age': 25, 'name': 'Scott', 'pet': 'Zuko'},
  {'age': 33, 'name': 'Katie', 'pet': 'Cisco'}]}

In [55]:
type(data)

dict

In [59]:
#We can also convert back data to JSON object

json.dumps(data)

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 25, "pet": "Zuko"}, {"name": "Katie", "age": 33, "pet": "Cisco"}]}'

In [64]:
#Loading data into DataFrame
DataFrmae1 = pd.DataFrame(data['siblings'])

In [65]:
DataFrmae1

   age   name    pet
0   25  Scott   Zuko
1   33  Katie  Cisco

In [66]:
pd.DataFrame(data['places_lived'])

               0
0  United States
1          Spain
2        Germany

In [75]:
from pandas import read_html

In [77]:
from lxml.html import parse
from urllib.request import urlopen

In [80]:
url = 'http://finance.yahoo.com/q/op?s=AAPL+Options'

In [81]:
Dframe_list = pd.io.html.read_html(url)

In [82]:
Dframe_list

[    0       1
 0 NaN  Search,
           Contract Name         Last Trade Date  Strike  Last Price    Bid  \
 0   AAPL170908C00120000  2017-09-05 12:33PM EDT   120.0       41.00  41.80
 1   AAPL170908C00125000  2017-09-06 10:42PM EDT   125.0       37.10  36.65
 2   AAPL170908C00130000  2017-09-06 11:20AM EDT   130.0       31.05  31.80
 3   AAPL170908C00135000  2017-09-01 12:20PM EDT   135.0       29.15  28.70
 4   AAPL170908C00137000  2017-09-06 10:42PM EDT   137.0       25.00  24.60
 5   AAPL170908C00138000  2017-08-25 11:49PM EDT   138.0       22.45  21.70
 6   AAPL170908C00140000  2017-09-06 12:56PM EDT   140.0       21.85  21.75
 7   AAPL170908C00142000   2017-08-31 9:48AM EDT   142.0       22.00  21.75
 8   AAPL170908C00143000  2017-08-28 11:55AM EDT   143.0       18.73  20.75
 9   AAPL170908C00144000  2017-09-06 10:25AM EDT   144.0       17.75  17.70
 10  AAPL170908C00145000  2017-09-06 11:18AM EDT   145.0       15.80  16.75
 11  AAPL170908C00146000  2017-08-08 10:22AM EDT   146.0       13.97  12.15
 12  AAPL170908C00147000  2017-09-06 12:29PM EDT   147.0       14.50  14.70
 13  AAPL170908C00148000  2017-09-06 12:29PM EDT   148.0       13.50  13.70
 14  AAPL170908C00149000  2017-09-06 12:29PM EDT   149.0       12.50  12.75
 15  AAPL170908C00150000   2017-09-06 2:28PM EDT   150.0       12.10  11.80
 16  AAPL170908C00152500   2017-09-06 2:41PM EDT   152.5        9.55   9.15
 17  AAPL170908C00155000   2017-09-06 3:59PM EDT   155.0        6.91   6.85
 18  AAPL170908C00157500   2017-09-06 3:58PM EDT   157.5        4.52   4.35
 19  AAPL170908C00160000   2017-09-06 3:59PM EDT   160.0        2.18   2.20
 20  AAPL170908C00162500   2017-09-06 3:59PM EDT   162.5        0.64   0.62
 21  AAPL170908C00165000   2017-09-06 3:59PM EDT   165.0        0.13   0.12
 22  AAPL170908C00167500   2017-09-06 3:59PM EDT   167.5        0.03   0.03
 23  AAPL170908C00170000   2017-09-06 3:53PM EDT   170.0        0.03   0.02
 24  AAPL170908C00172500   2017-09-06 3:19PM EDT   172.5        0.01   0.01
 25  AAPL170908C00175000   2017-09-06 3:55PM EDT   175.0        0.01   0.00
 26  AAPL170908C00177500   2017-09-06 2:39PM EDT   177.5        0.02   0.00
 27  AAPL170908C00180000  2017-09-06 10:21AM EDT   180.0        0.01   0.00
 28  AAPL170908C00182500  2017-09-05 10:15AM EDT   182.5        0.01   0.00
 29  AAPL170908C00185000   2017-08-31 3:59PM EDT   185.0        0.01   0.00
 30  AAPL170908C00187500   2017-09-01 3:46PM EDT   187.5        0.01   0.00
 31  AAPL170908C00190000  2017-08-18 11:45PM EDT   190.0        0.02   0.00

       Ask  Change % Change  Volume  Open Interest Implied Volatility
 0   42.05    0.00        -       2             51            148.44%
 1   37.05    0.00        -       7              0            171.88%
 2   32.05    0.05   +0.16%      75              9            112.50%
 3   29.35    2.74  +10.37%       2              6            241.02%
 4   25.10    0.00        -       2              0            124.61%
 5   22.40    0.00        -       3              0              0.00%
 6   22.05   -2.05   -8.58%      38             14            105.08%
 7   22.40    0.00        -      55             45            195.21%
 8   21.40    0.00        -      63             65            188.38%
 9   18.05    1.35   +8.23%       8            127             87.70%
 10  17.10   -0.89   -5.33%       1             14             60.16%
 11  12.95    0.00        -      15              8              0.00%
 12  15.10   -0.95   -6.15%     393             72             79.39%
 13  14.10   -2.63  -16.31%     215             41             74.80%
 14  13.05   -2.64  -17.44%       9            150             66.21%
 15  12.00    0.01   +0.08%      54            277             56.84%
 16   9.50   -0.05   -0.52%     105            723             46.48%
 17   7.00   -0.26   -3.63%    1136           3265             35.94%
 18   4.60   -0.24   -5.04%    2885           4616             30.37%
 19   2.29   -0.55  -20.15%   14132          11736             22.66%
 20   0.66   -0.48  -42.86%   29100          15059             19.31%
 21   0.13   -0.21  -61.76%   19230          25711             20.66%
 22   0.04   -0.07  -70.00%    6888          14370             25.00%
 23   0.03   -0.01  -25.00%    4164          14475             32.23%
 24   0.02   -0.02  -66.67%     721           3685             38.28%
 25   0.02   -0.01  -50.00%    1935           6857             45.31%
 26   0.01    0.00        -    1315           1974             48.44%
 27   0.01    0.00        -       6           3706             51.56%
 28   0.01    0.00        -       8             84             56.25%
 29   0.01    0.00        -      36            106             62.50%
 30   0.01    0.00        -     306             13             68.75%
 31   0.04    0.00        -       1              1             85.16%  ,
           Contract Name         Last Trade Date  Strike  Last Price    Bid  \
 0   AAPL170908P00120000   2017-08-24 3:05PM EDT   120.0        0.01   0.00
 1   AAPL170908P00125000   2017-08-30 3:45PM EDT   125.0        0.01   0.00
 2   AAPL170908P00130000   2017-08-30 3:50PM EDT   130.0        0.01   0.00
 3   AAPL170908P00135000   2017-08-31 3:59PM EDT   135.0        0.01   0.00
 4   AAPL170908P00137000  2017-09-01 10:48AM EDT   137.0        0.01   0.00
 5   AAPL170908P00138000   2017-09-01 1:32PM EDT   138.0        0.01   0.00
 6   AAPL170908P00139000   2017-09-01 3:04PM EDT   139.0        0.01   0.01
 7   AAPL170908P00140000   2017-09-06 2:56PM EDT   140.0        0.01   0.00
 8   AAPL170908P00141000  2017-09-05 12:31PM EDT   141.0        0.01   0.00
 9   AAPL170908P00142000  2017-09-05 12:49PM EDT   142.0        0.03   0.00
 10  AAPL170908P00143000  2017-09-06 12:31PM EDT   143.0        0.01   0.00
 11  AAPL170908P00144000   2017-09-06 1:05PM EDT   144.0        0.01   0.00
 12  AAPL170908P00145000   2017-09-06 3:31PM EDT   145.0        0.01   0.00
 13  AAPL170908P00146000   2017-09-06 3:56PM EDT   146.0        0.01   0.00
 14  AAPL170908P00147000  2017-09-06 11:59AM EDT   147.0        0.02   0.01
 15  AAPL170908P00148000  2017-09-06 11:57AM EDT   148.0        0.03   0.01
 16  AAPL170908P00149000  2017-09-06 11:40AM EDT   149.0        0.03   0.01
 17  AAPL170908P00150000   2017-09-06 3:25PM EDT   150.0        0.02   0.01
 18  AAPL170908P00152500   2017-09-06 3:59PM EDT   152.5        0.03   0.02
 19  AAPL170908P00155000   2017-09-06 3:53PM EDT   155.0        0.05   0.04
 20  AAPL170908P00157500   2017-09-06 3:59PM EDT   157.5        0.10   0.08
 21  AAPL170908P00160000   2017-09-06 3:59PM EDT   160.0        0.32   0.31
 22  AAPL170908P00162500   2017-09-06 3:59PM EDT   162.5        1.25   1.17
 23  AAPL170908P00165000   2017-09-06 3:59PM EDT   165.0        3.15   3.15
 24  AAPL170908P00167500   2017-09-06 2:48PM EDT   167.5        5.70   5.35
 25  AAPL170908P00170000   2017-09-06 2:40PM EDT   170.0        8.00   7.90
 26  AAPL170908P00172500   2017-09-06 3:21PM EDT   172.5       10.50  10.30
 27  AAPL170908P00175000  2017-09-06 10:36AM EDT   175.0       13.30  13.00
 28  AAPL170908P00177500  2017-09-06 11:18AM EDT   177.5       16.75  15.45
 29  AAPL170908P00180000   2017-09-01 3:47PM EDT   180.0       16.00  15.65
 30  AAPL170908P00187500   2017-09-06 9:46AM EDT   187.5       25.00  25.35
 31  AAPL170908P00210000  2017-09-06 10:43PM EDT   210.0       48.65  47.85

       Ask  Change % Change  Volume  Open Interest Implied Volatility
 0    0.03    0.00        -       6             80            148.44%
 1    0.01    0.00        -     150            307            118.75%
 2    0.02    0.00        -      34            201            107.81%
 3    0.01    0.00        -     206            246             84.38%
 4    0.01    0.00        -     202            567             78.13%
 5    0.01    0.00        -     219            280             75.00%
 6    0.02    0.00        -     289            190             80.47%
 7    0.01    0.00        -       7           1054             68.75%
 8    0.02    0.00        -      12           1127             70.31%
 9    0.01    0.00        -       1            243             62.50%
 10   0.02    0.00        -      34            306             64.06%
 11   0.01   -0.01  -50.00%      24            851             56.25%
 12   0.01    0.00        -      53           1145             53.13%
 13   0.01   -0.01  -50.00%     435           1082             50.00%
 14   0.02    0.00        -     113           1391             53.91%
 15   0.02    0.00        -     160            859             50.00%
 16   0.02    0.00        -     458           1838             48.44%
 17   0.02   -0.02  -50.00%     808           2799             45.31%
 18   0.03   -0.03  -50.00%    2073           5933             38.67%
 19   0.05   -0.06  -54.55%    3907           6019             32.23%
 20   0.10   -0.12  -54.55%    4653           8497             25.78%
 21   0.33   -0.22  -40.74%   27484          11744             21.29%
 22   1.25   -0.20  -13.79%   11642          11519             19.34%
 23   3.30    0.02   +0.64%    1736           5078             23.83%
 24   5.90    0.25   +4.59%      23            438             40.23%
 25   8.30   -0.01   -0.12%      11             85             46.97%
 26  10.75    0.65   +6.60%      21             18             53.91%
 27  13.35    1.65  +14.16%       2             43             56.25%
 28  15.75    1.00   +6.35%       2             24             72.46%
 29  16.25    0.20   +1.27%      17             24              0.00%
 30  25.80  -14.10  -36.06%      40              0            110.94%
 31  48.25    0.00        -       2              3            169.34%  ]

In [87]:
Dframe = Dframe_list[1]

In [88]:
Dframe

,Contract Name,Last Trade Date,Strike,Last Price,Bid,Ask,Change,% Change,Volume,Open Interest,Implied Volatility
0,AAPL170908C00120000,2017-09-05 12:33PM EDT,120.0,41.00,41.80,42.05,0.00,-,2,51,148.44%
1,AAPL170908C00125000,2017-09-06 10:42PM EDT,125.0,37.10,36.65,37.05,0.00,-,7,0,171.88%
2,AAPL170908C00130000,2017-09-06 11:20AM EDT,130.0,31.05,31.80,32.05,0.05,+0.16%,75,9,112.50%
3,AAPL170908C00135000,2017-09-01 12:20PM EDT,135.0,29.15,28.70,29.35,2.74,+10.37%,2,6,241.02%
4,AAPL170908C00137000,2017-09-06 10:42PM EDT,137.0,25.00,24.60,25.10,0.00,-,2,0,124.61%
5,AAPL170908C00138000,2017-08-25 11:49PM EDT,138.0,22.45,21.70,22.40,0.00,-,3,0,0.00%
6,AAPL170908C00140000,2017-09-06 12:56PM EDT,140.0,21.85,21.75,22.05,-2.05,-8.58%,38,14,105.08%
7,AAPL170908C00142000,2017-08-31 9:48AM EDT,142.0,22.00,21.75,22.40,0.00,-,55,45,195.21%
8,AAPL170908C00143000,2017-08-28 11:55AM EDT,143.0,18.73,20.75,21.40,0.00,-,63,65,188.38%
9,AAPL170908C00144000,2017-09-06 10:25AM EDT,144.0,17.75,17.70,18.05,1.35,+8.23%,8,127,87.70%
10,AAPL170908C00145000,2017-09-06 11:18AM EDT,145.0,15.80,16.75,17.10,-0.89,-5.33%,1,14,60.16%
11,AAPL170908C00146000,2017-08-08 10:22AM EDT,146.0,13.97,12.15,12.95,0.00,-,15,8,0.00%
12,AAPL170908C00147000,2017-09-06 12:29PM EDT,147.0,14.50,14.70,15.10,-0.95,-6.15%,393,72,79.39%
13,AAPL170908C00148000,2017-09-06 12:29PM EDT,148.0,13.50,13.70,14.10,-2.63,-16.31%,215,41,74.80%
14,AAPL170908C00149000,2017-09-06 12:29PM EDT,149.0,12.50,12.75,13.05,-2.64,-17.44%,9,150,66.21%
15,AAPL170908C00150000,2017-09-06 2:28PM EDT,150.0,12.10,11.80,12.00,0.01,+0.08%,54,277,56.84%
16,AAPL170908C00152500,2017-09-06 2:41PM EDT,152.5,9.55,9.15,9.50,-0.05,-0.52%,105,723,46.48%
17,AAPL170908C00155000,2017-09-06 3:59PM EDT,155.0,6.91,6.85,7.00,-0.26,-3.63%,1136,3265,35.94%
18,AAPL170908C00157500,2017-09-06 3:58PM EDT,157.5,4.52,4.35,4.60,-0.24,-5.04%,2885,4616,30.37%
19,AAPL170908C00160000,2017-09-06 3:59PM EDT,160.0,2.18,2.20,2.29,-0.55,-20.15%,14132,11736,22.66%
20,AAPL170908C00162500,2017-09-06 3:59PM EDT,162.5,0.64,0.62,0.66,-0.48,-42.86%,29100,15059,19.31%
21,AAPL170908C00165000,2017-09-06 3:59PM EDT,165.0,0.13,0.12,0.13,-0.21,-61.76%,19230,25711,20.66%
22,AAPL170908C00167500,2017-09-06 3:59PM EDT,167.5,0.03,0.03,0.04,-0.07,-70.00%,6888,14370,25.00%
23,AAPL170908C00170000,2017-09-06 3:53PM EDT,170.0,0.03,0.02,0.03,-0.01,-25.00%,4164,14475,32.23%
24,AAPL170908C00172500,2017-09-06 3:19PM EDT,172.5,0.01,0.01,0.02,-0.02,-66.67%,721,3685,38.28%
25,AAPL170908C00175000,2017-09-06 3:55PM EDT,175.0,0.01,0.00,0.02,-0.01,-50.00%,1935,6857,45.31%
26,AAPL170908C00177500,2017-09-06 2:39PM EDT,177.5,0.02,0.00,0.01,0.00,-,1315,1974,48.44%
27,AAPL170908C00180000,2017-09-06 10:21AM EDT,180.0,0.01,0.00,0.01,0.00,-,6,3706,51.56%
28,AAPL170908C00182500,2017-09-05 10:15AM EDT,182.5,0.01,0.00,0.01,0.00,-,8,84,56.25%
29,AAPL170908C00185000,2017-08-31 3:59PM EDT,185.0,0.01,0.00,0.01,0.00,-,36,106,62.50%
30,AAPL170908C00187500,2017-09-01 3:46PM EDT,187.5,0.01,0.00,0.01,0.00,-,306,13,68.75%
31,AAPL170908C00190000,2017-08-18 11:45PM EDT,190.0,0.02,0.00,0.04,0.00,-,1,1,85.16%

In [89]:
Dframe.columns.values

array(['Contract Name', 'Last Trade Date', 'Strike', 'Last Price', 'Bid',
       'Ask', 'Change', '% Change', 'Volume', 'Open Interest',
       'Implied Volatility'], dtype=object)

In [90]:
parsed = parse(urlopen('http://finance.yahoo.com/q/op?s=AAPL+Options'))
doc = parsed.getroot()

In [91]:
doc

In [109]:
# EXCEL with Python


ExcelData = pd.ExcelFile('Excel1.xlsx')

In [110]:
ExcelData

In [111]:
table = ExcelData.parse('Sheet1')

In [112]:
table

     Name  Class Locatio
0   Pawan     34     PPP
1   Rahul     38     RRR
2  Dinesh     10     YYY

In [113]:
#Interacting with Databases

import sqlite3

In [114]:
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
c REAL, d INTEGER
);"""

In [115]:
con = sqlite3.connect(':memory:')

In [116]:
con.execute(query)

In [117]:
con.commit()

In [118]:
data = [('Atlanta', 'Georgia', 1.25, 6),('Tallahassee', 'Florida', 2.6, 3),('Sacramento', 'California', 1.7, 5)]

In [119]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [120]:
con.executemany(stmt, data)
con.commit()

In [121]:
cursor = con.execute('select * from test')

In [122]:
cursor

In [123]:
rows = cursor.fetchall()

In [124]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [125]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [133]:
#In Python 2, zip returned a list. In Python 3, zip returns an iterable object. 
#But you can make it into a list just by calling list, e.g. list(zip(*ngram))

DatabseFrsme = DataFrame(rows, columns=list(zip(*cursor.description))[0])

In [134]:
DatabseFrsme

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [135]:
import pandas.io.sql as sql

In [137]:
sql.read_sql('select * from test',con)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5